Repository: BohdanTron/RemindMeBot
Catalog: RemindMeBot/Resources/BotMessages.*.resx
Languages: uk_ua

# AskForLanguage
source: Please choose your language:
uk_ua: Будь ласка виберіть мову:

# AskForLocation
source: Please enter your location (e.g London, United Kingdom)
uk_ua: Будь ласка вкажіть ваше місцезнаходження (наприклад Київ, Україна)

# AskForReminderDate
source: When should I remind you?
uk_ua: Коли я маю нагадати про це?

# AskForReminderText
source: Please enter the title of the reminder
uk_ua: Будь ласка введіть текст для нагадування

# AskSettingToChange
source: Which setting would you like to change?
uk_ua: Що саме ви бажаєте змінити?

# AskToRetryLocation
source: I couldn't find your location. For better accuracy, please provide both your city and country names
uk_ua: Мені не вдалося знайти ваше місцезнаходження. Для кращої точності, будь ласка вкажіть назву вашого міста та країни

# DateNotRecognized
source: I couldn't recognize the date and time you entered, or it's not in the future. Please try again using a different format or phrase like "tomorrow at 3 PM", "next Wednesday", or "in a week".
uk_ua: Мені не вдалось розпізнати введену дату та час або вони не є майбутніми. Будь ласка, спробуйте ще раз, використовуючи інший формат або фразу, наприклад "завтра о 15:00", "наступної середи" або "через тиждень".

source: Language
uk_ua: Мова

source: Location
uk_ua: Місцезнаходження

# NoActiveOperations
source: There are no active operations to cancel
uk_ua: Наразі у вас нема активних операцій для скасування

# NoUserSettings
source: You haven't set your preferences yet. Please use the */start* command to set up your settings first
uk_ua: Ви ще не встановили свої налаштування. Будь ласка, спочатку використайте команду **/start** для налаштування

# OperationCancelled
source: The current operation has been cancelled
uk_ua: Поточну операцію скасовано

# OptionListRetryPrompt
source: Please choose an option from the list:
uk_ua: Будь ласка виберіть опцію зі списку:

# ReminderAdded
source: Reminder added: *"{0}"* on *{1}*
uk_ua: Нагадування додано: *"{0}"* на *{1}* о *{2}*

# UnknownCommand
source: Unknown command. Please enter a valid command
uk_ua: Невідома команда. Будь ласка введіть коректну команду

# UserCurrentSettings
source: Your current settings: - language - *{0}* - location - *{1}* - timezone - *{2}* - local time - *{3}*
uk_ua: Ваші поточні налаштування: - мова - *{0}* - місцезнаходження - *{1}* - часовий пояс - *{2}* - місцевий час - *{3}*

# UserSettingsHaveBeenChanged
source: Your settings have been changed!
uk_ua: Ваші налаштування були змінені!

# AskWhetherToRepeatReminder
source: Do you want this reminder to repeat?
uk_ua: Чи бажаєте повторювати нагадування?

source: yes
uk_ua: так

source: no
uk_ua: ні

# AskForRepeatInterval
source: How often should it repeat?
uk_ua: Як часто це нагадування має повторюватись?

source: daily
uk_ua: щодня

source: weekly
uk_ua: щотижня

source: monthly
uk_ua: щомісяця

source: yearly
uk_ua: щорічно

# RepeatedReminderAdded
source: Reminder added: *"{0}"* on *{1}*, repeating *{2}*
uk_ua: Нагадування додано: *"{0}"* на *{1}* о *{2}*, повторюється *{3}*

# UnexpectedError
source: Oops, something went wrong. Please try again later
uk_ua: Ой, щось пішло не так. Будь ласка, спробуйте знову пізніше

# RemindersList
source: Here's the list of your reminders. If you want to delete a reminder, press the corresponding button below:
uk_ua: Ваш список нагадувань. Для того щоб видалити нагадування, натисніть на відповідну кнопку нижче:

# NoRemindersCreated
source: You don't have any reminders so far
uk_ua: Наразі у вас нема жодного нагадування

# ReminderDeleted
source: Reminder has been deleted
uk_ua: Нагадування було видалено

# AskToChangeLocation
source: Please enter your location (e.g., London, United Kingdom). *Note:* If this change updates your timezone, it may affect the timing of active reminders. Reminders are set based on the timezone at creation, so they could trigger at different local times after a timezone change. Please check your reminders after updating your location to ensure their timings are as expected.
uk_ua: Будь ласка, введіть ваше місцезнаходження (наприклад, Київ, Україна). *Зверніть увагу:* якщо разом зі зміною місцезнаходження зміниться ваш часовий пояс, це може вплинути на час виконання активних нагадувань. Нагадування встановлюються на основі часового поясу під час створення, тому після зміни часового поясу вони можуть спрацювати в інший час. Будь ласка, перевірте свої нагадування після оновлення місцезнаходження, щоб переконатися, що час їх виконання відповідає вашим очікуванням.
